<a href="https://colab.research.google.com/github/Edna-soso/DataAnalysis_Project/blob/main/Data_Prepro/Data_Preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
data = pd.read_csv('/content/drive/MyDrive/python_OP/OnlineRetail.csv', encoding = 'unicode_escape')

print(data.shape)

(541909, 8)

In [ ]:
data.isna().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

Loại bỏ những hàng có CustomerID rỗng

In [ ]:
data = data[pd.notnull(data['CustomerID'])]

In [ ]:
data.shape

(406829, 8)

In [ ]:
data.describe()

            Quantity      UnitPrice     CustomerID
count  406829.000000  406829.000000  406829.000000
mean       12.061303       3.460471   15287.690570
std       248.693370      69.315162    1713.600303
min    -80995.000000       0.000000   12346.000000
25%         2.000000       1.250000   13953.000000
50%         5.000000       1.950000   15152.000000
75%        12.000000       3.750000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [ ]:
data = data.query("Quantity > 0")
data.shape

(397924, 8)

In [ ]:
data.describe()

            Quantity      UnitPrice     CustomerID
count  397924.000000  397924.000000  397924.000000
mean       13.021823       3.116174   15294.315171
std       180.420210      22.096788    1713.169877
min         1.000000       0.000000   12346.000000
25%         2.000000       1.250000   13969.000000
50%         6.000000       1.950000   15159.000000
75%        12.000000       3.750000   16795.000000
max     80995.000000    8142.750000   18287.000000

In [ ]:
data['Date']=[item[0] for item in data['InvoiceDate'].str.split()]
data['Time']=[item[1] for item in data['InvoiceDate'].str.split()]
data['Hour']=[item[0] for item in data['Time'].str.split(':')]
data['Month']=[item[0] for item in data['Date'].str.split('/')]
data['Year']=[item[2] for item in data['Date'].str.split('/')]
data['TotalCost']=data['Quantity']*data['UnitPrice']

In [ ]:
data

       InvoiceNo StockCode  ...  Year  TotalCost
0         536365    85123A  ...  2010      15.30
1         536365     71053  ...  2010      20.34
2         536365    84406B  ...  2010      22.00
3         536365    84029G  ...  2010      20.34
4         536365    84029E  ...  2010      20.34
...          ...       ...  ...   ...        ...
541904    581587     22613  ...  2011      10.20
541905    581587     22899  ...  2011      12.60
541906    581587     23254  ...  2011      16.60
541907    581587     23255  ...  2011      16.60
541908    581587     22138  ...  2011      14.85

[397924 rows x 14 columns]

Phân tích khách hàng dựa trên 3 yếu tố RFM

In [ ]:
#Tao them cot tien te (Monetary)
data['Amount'] = data['Quantity']*data['UnitPrice']
rfm_m = data.groupby('CustomerID')['Amount'].sum()
rfm_m = rfm_m.reset_index()
rfm_m.head()

   CustomerID    Amount
0     12346.0  77183.60
1     12347.0   4310.00
2     12348.0   1797.24
3     12349.0   1757.55
4     12350.0    334.40

In [ ]:
#Thong ke theo tien te
rfm_f = data.groupby('CustomerID')['InvoiceNo'].count()
rfm_f = rfm_f.reset_index()
rfm_f.columns = ['CustomerID', 'Frequency']
rfm_f.head()

   CustomerID  Frequency
0     12346.0          1
1     12347.0        182
2     12348.0         31
3     12349.0         73
4     12350.0         17

In [ ]:
#Hop nhat hai bang
rfm = pd.merge(rfm_m, rfm_f, on='CustomerID', how='inner')
rfm.head()

   CustomerID    Amount  Frequency
0     12346.0  77183.60          1
1     12347.0   4310.00        182
2     12348.0   1797.24         31
3     12349.0   1757.55         73
4     12350.0    334.40         17

In [ ]:
# Chuyển đổi sang datetime thành kiểu dữ liệu thích hợp
max_date = max(data['InvoiceDate'])
max_date

'9/9/2011 9:52'